In [4]:
import pandas as pd
import numpy as np

In [5]:
df = pd.read_csv(r'data/ds_salaries.csv')

### PREPROCESAMIENTO

In [6]:
df.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Principal Data Scientist,80000,EUR,85847,ES,100,ES,L
1,2023,MI,CT,ML Engineer,30000,USD,30000,US,100,US,S
2,2023,MI,CT,ML Engineer,25500,USD,25500,US,100,US,S
3,2023,SE,FT,Data Scientist,175000,USD,175000,CA,100,CA,M
4,2023,SE,FT,Data Scientist,120000,USD,120000,CA,100,CA,M

In [7]:
df.columns #saber las columnas

Index(['work_year', 'experience_level', 'employment_type', 'job_title',
       'salary', 'salary_currency', 'salary_in_usd', 'employee_residence',
       'remote_ratio', 'company_location', 'company_size'],
      dtype='object')

In [8]:
df.shape #saber las dimensiones

(3755, 11)

In [9]:
df.dtypes #saber los tipos de datos

work_year              int64
experience_level      object
employment_type       object
job_title             object
salary                 int64
salary_currency       object
salary_in_usd          int64
employee_residence    object
remote_ratio           int64
company_location      object
company_size          object
dtype: object

In [10]:
df.isnull().sum() #saber los valores nulos

work_year             0
experience_level      0
employment_type       0
job_title             0
salary                0
salary_currency       0
salary_in_usd         0
employee_residence    0
remote_ratio          0
company_location      0
company_size          0
dtype: int64

In [11]:
df.duplicated().sum() #saber los valores duplicados

np.int64(1171)

In [12]:
def mas_repetidos(df):
    df_duplicados = df[df.duplicated(keep=False)]
    df_agrupado = df_duplicados.groupby(df.columns.tolist()).size().reset_index().rename(columns={0: 'count'})
    df_ordenado = df_agrupado.sort_values(by='count', ascending=False)
    return df_ordenado

mas_repetidos(df)

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size,count
223,2022,SE,FT,Data Scientist,191475,USD,191475,US,100,US,M,21
201,2022,SE,FT,Data Scientist,141525,USD,141525,US,100,US,M,21
399,2023,SE,FT,Data Engineer,129000,USD,129000,US,0,US,M,13
441,2023,SE,FT,Data Engineer,252000,USD,252000,US,0,US,M,13
221,2022,SE,FT,Data Scientist,185900,USD,185900,US,0,US,M,12
...,...,...,...,...,...,...,...,...,...,...,...,...
510,2023,SE,FT,Data Scientist,239748,USD,239748,US,0,US,M,2
508,2023,SE,FT,Data Scientist,228000,USD,228000,US,0,US,M,2
507,2023,SE,FT,Data Scientist,225000,USD,225000,US,100,US,M,2
504,2023,SE,FT,Data Scientist,201000,USD,201000,US,0,US,M,2
503,2023,SE,FT,Data Scientist,200160,USD,200160,US,0,US,M,2

In [13]:
df.drop_duplicates(inplace=True) #eliminar duplicados

In [14]:
df.shape

(2584, 11)

### EDA

In [15]:
df.head(1)

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Principal Data Scientist,80000,EUR,85847,ES,100,ES,L

¿de que pais son la compañias mas grande?

In [19]:
# def compania_grande(df, columna):
  #  conteo = df[columna].value_counts()
  #  valor_mas = conteo.idxmax()
  #  cantidad_repeticiones = conteo.max()
  #  return valor_mas, cantidad_repeticiones

# valor, repeticiones = compania_grande(df, 'company_location')
# print(f"La compañias más grande estan: {valor}, con {repeticiones}")


df1 = df.loc[df['company_size'] == 'L','company_location'].value_counts().idxmax()
df2 = df.loc[df['company_size'] == 'L','company_location'].value_counts().max()
print(f'El pais donde estan las compañia mas grande es: {df1} con: {df2}')

El pais donde estan las compañia mas grande es: US con: 220

En que puesto se gana mas

In [29]:
# def salario_max(df, columna):
  #  maxim_usd = df[columna].value_counts()
  #  valor_max = maxim_usd.idxmax()
  #  return valor_max

# valor, trabajo = salario_max(df, 'salary_in_usd')
# print(f'El trabajo mas pagado es: {valor} con {trabajo}')

# df3 = df.loc[df('job_title')['salary_in_usd']].max

# df.groupby('job_title')['salary_in_usd'].max()

df3, df4 = df.groupby('job_title')['salary_in_usd'].max().idxmax(), df.groupby('job_title')['salary_in_usd'].max().max(0)
print(f'El trabajo más pagado es: {df3} con un salario de: {df4}')

# df.groupby(['job_title', 'employee_residence'])['salary_in_usd'].max().reset_index()
# solucion del profesor

El trabajo más pagado es: Research Scientist con un salario de: 450000

                         job_title employee_residence  salary_in_usd
0    3D Computer Vision Researcher                 AS          20000
1    3D Computer Vision Researcher                 CA          10000
2    3D Computer Vision Researcher                 IN           5409
3    3D Computer Vision Researcher                 US          50000
4                     AI Developer                 BA         120000
..                             ...                ...            ...
377             Research Scientist                 US         450000
378         Software Data Engineer                 NG          50000
379         Software Data Engineer                 SG          75020
380             Staff Data Analyst                 NG          15000
381           Staff Data Scientist                 US         105000

[382 rows x 3 columns]

Tipo de trabajo, pais de residencia donde mas se cobra?

In [26]:
salary = df.groupby(['job_title', 'employee_residence'])['salary_in_usd'].mean().reset_index()
mayor_salario = salary.sort_values(by='salary_in_usd', ascending=False).head(1)
print(mayor_salario)

       job_title employee_residence  salary_in_usd
21  AI Scientist                 IL       423834.0

¿El nivel de  experiencia es proporcional al salario

cuanto se cobra de media por cada nivel de experiencia?

en qué tamaño de compañía trabajan más

por que porcentage promedio se aumenta el salario entre nivel de experiencia

In [21]:
# df_exp['experience_level'].unique()
promedio_salary = df.groupby('experience_level')['salary_in_usd'].mean()
ord_experience = ['EN', 'MI', 'SE', 'EX']
avg_salary = promedio_salary.reindex(ord_experience)
percent_increment = avg_salary.pct_change() * 100
percent_avg = percent_increment.mean()
percent_avg

np.float64(38.48633916684714)

en que pais se cobra  mas por tipo de empleo?

In [44]:
df.groupby(['company_location','job_title']).agg({'salary_in_usd':'mean'}).round(2).sort_values(by=['salary_in_usd','company_location'],ascending=False)

                                                salary_in_usd
company_location job_title
IL               AI Scientist                        423834.0
US               Data Analytics Lead                 405000.0
                 Data Science Tech Lead              375000.0
IN               AI Developer                        300000.0
US               Director of Data Science            294375.0
...                                                       ...
CH               Big Data Engineer                     5882.0
IN               Data Science Consultant               5707.0
                 3D Computer Vision Researcher         5409.0
                 Power BI Developer                    5409.0
CZ               NLP Engineer                          5132.0

[356 rows x 1 columns]

wich are experience level more required

quiero decir, cuáles se repiten más en este set de datos, las empresas medianas, grandes o pequeñas